Model: "EdgeFallNet"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_layer (InputLayer)       [(None, 4760, 6)]    0           []                               
                                                                                                  
 initial_conv (SeparableConv1D)  (None, 4760, 16)    142         ['input_layer[0][0]']            
                                                                                                  
 pool1 (MaxPooling1D)           (None, 952, 16)      0           ['initial_conv[0][0]']           
                                                                                                  
 squeeze_fire1 (Conv1D)         (None, 952, 8)       136         ['pool1[0][0]']                  
                                                                                                  
 expand1x1_fire1 (Conv1D)       (None, 952, 4)       36          ['squeeze_fire1[0][0]']          
                                                                                                  
 expand3x3_fire1 (SeparableConv  (None, 952, 6)      78          ['squeeze_fire1[0][0]']          
 1D)                                                                                              
                                                                                                  
 merge_fire1 (Concatenate)      (None, 952, 10)      0           ['expand1x1_fire1[0][0]',        
                                                                  'expand3x3_fire1[0][0]']        
                                                                                                  
 pool2 (MaxPooling1D)           (None, 191, 10)      0           ['merge_fire1[0][0]']            
                                                                                                  
 squeeze_fire2 (Conv1D)         (None, 191, 8)       88          ['pool2[0][0]']                  
                                                                                                  
 expand1x1_fire2 (Conv1D)       (None, 191, 4)       36          ['squeeze_fire2[0][0]']          
                                                                                                  
 expand3x3_fire2 (SeparableConv  (None, 191, 6)      78          ['squeeze_fire2[0][0]']          
 1D)                                                                                              
                                                                                                  
 merge_fire2 (Concatenate)      (None, 191, 10)      0           ['expand1x1_fire2[0][0]',        
                                                                  'expand3x3_fire2[0][0]']        
                                                                                                  
 pool3 (MaxPooling1D)           (None, 39, 10)       0           ['merge_fire2[0][0]']            
                                                                                                  
 flatten (Flatten)              (None, 390)          0           ['pool3[0][0]']                  
                                                                                                  
 dense1 (Dense)                 (None, 8)            3128        ['flatten[0][0]']                
                                                                                                  
 dropout (Dropout)              (None, 8)            0           ['dense1[0][0]']                 
                                                                                                  
 output (Dense)                 (None, 1)            9           ['dropout[0][0]']                
                                                                                                  
==================================================================================================
Total params: 3,731
Trainable params: 3,731
Non-trainable params: 0
__________________________________________________________________________________________________